Revit 2027 API
ExternalDataManagerDataItem.PathType Property
 The path type of the saved path (e.g. "Absolute", "Relative", "Cloud").
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string PathType { get; set; }
Public Property PathType As String
	Get
	Set
public:
property String^ PathType {
	String^ get ();
	void set (String^ value);
}
member PathType : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ExternalDataManagerDataItem Class
Autodesk.Revit.UI Namespace